Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: །ཞེས་ཀྱང་གསུངས་ལ། ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་དུ་སེམས་ཅན་བསོད་ནམས་དང་ལྡན་པའི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་བསྔོས་པས་ནི་རེ་བའི་བསམ་པ་འགྲུབ་པར་འགྱུར་རོ་ཞེས་ཀྱང་གསུངས་ན།
en: Bhagavat, you have also said, “The intentions and aspirations of beings who have merit will be fulfilled through dedicating their good roots.” “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གང་བདག་གིས་ཀྱང་སྦྱིན་པ་ལས་བྱུང་བ་དང་། ཚུལ་ཁྲིམས་ལས་བྱུང་བ་དང་། ཐོས་པ་ལས་བྱུང་བ་དང་། བསྒོམ་པ་ལས་བྱུང་བའི་བསོད་ནམས་དག་བསྒྲུབས་པས་ན།
en: Bhadanta Bhagavat, I have acquired the merit that comes from generosity, from good conduct, from listening, and from meditation.

source: གལ་ཏེ་བདག་གིས་སྨོན་ལམ་ཇི་ལྟར་བཏབ་པ་དེ་ལྟར་རེ་བ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན། དེའི་སླད་དུ་བདག་གིས་དགེ་བའི་རྩ་བ་དེ་དག་ཐམས་ཅད་སེམས་ཅན་གང་དག་གིས་སེམས་ཅན་དམྱལ་བ་མནར་མེད་པར་རབ་ཏུ་རྩུབ་ཅིང་དྲག་པའི་སྡུག་བསྔལ་ཉམས་སུ་མྱོང་བའི་སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་རྣམས་ཀྱི་སླད་དུ་ཡོངས་སུ་བསྔོ་བར་བགྱིའོ།
en: If my aspirations are to be completely fulfilled as I have prayed for, then I dedicate all those good roots to the beings in hell, to those beings who experience severe and fierce suffering in the Avīci hell.

source: །དགེ་བའི་རྩ་བ་དེས་དེ་དག་དེ་ནས་ལྡང་བར་འགྱུར་ཞིང་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་མི་འཐོབ་པ་ཐོབ་པར་གྱུར་ཅིག །
en: Through these good roots, may they rise from those hells and attain a human existence in this buddha realm.

source: དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་ཆོས་འདུལ་བ་བསྒྲུབ་པར་བགྱིད་པར་འགྱུར་ཞིང་མཆོག་ཉིད་ཀྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་ཡང་གྱུར་ཅིག །
en: May they accomplish the Dharma and Vinaya as taught by the Tathāgata, and being at the highest level, may they enter parinirvāṇa. “ ‘

source: སེམས་ཅན་དེ་དག་གི་ལས་ཀྱི་འབྲས་བུ་ཡོངས་སུ་མ་བས་པར་གྱུར་ན་ཡང་དེའི་སླད་དུ་བདག་གུམ་ནས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་སྐྱེ་བར་འགྱུར་ཞིང་།
en: If those beings will not have their karmic results eliminated, then may I die now and be reborn in a great hell.

source: བདག་གི་ལུས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་ཏིང་ངེ་འཛིན་གྱིས་ཀྱང་མི་སྩོལ་བ་དག་འབྱུང་བར་གྱུར་ཅིག །
en: May I have as many bodies as there are particles comprising a buddha realm.

source: བདག་གི་ལུས་རེ་རེའི་ཚད་ཀྱང་རིའི་རྒྱལ་པོ་རི་རབ་ཙམ་དུ་ཆེ་བ་དག་འབྱུང་བར་གྱུར་ཅིག །
en: May each body be the size of Sumeru, the king of mountains.

source: བདག་གི་ལུས་རེ་རེས་ཀྱང་ཇི་ལྟར་ད་ལྟར་གྱི་ལུས་གཅིག་པུ་འདིས་བདེ་བ་དང་། སྡུག་བསྔལ་གྱི་ཚོར་བ་དག་ཡང་དག་པར་འཚལ་བ་དེ་ལྟ་བུའི་བདེ་བ་དང་། སྡུག་བསྔལ་གྱི་ཚོར་བ་དག་ཡང་དག་པར་འཚལ་བར་གྱུར་ཅིག །
en: May each of those bodies be able to experience the same intense suffering as my current body can.

source: བདག་གི་ལུས་རེ་རེས་ཀྱང་སེམས་ཅན་དམྱལ་བ་པའི་སྡུག་བསྔལ་དྲག་པ་རྩུབ་པ་མི་བཟད་པ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་མྱོང་བར་གྱུར་ཅིག །
en: May each of my bodies, as numerous as the particles in a buddha realm, experience the powerful, fierce, harsh injuries that a being in hell experiences. “ ‘

source: ད་ལྟར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་ན་སེམས་ཅན་གང་དག་མཚམས་མ་མཆིས་པ་བགྱིད་པ་དང་། མནར་མེད་པའི་བར་དག་ལ་གཞོལ་བའི་ལས་ཡང་དག་པར་སྩོགས་པར་འགྱུར་བ་རྣམས་དང་།
en: At present, in the buddha realms in the ten directions, which are as numerous as the particles in a buddha realm, there are beings who have committed the actions that have immediate results at death, and so on, up to and including beings who have created the karma for going to the Avīci hell.

source: སེམས་ཅན་གང་དག་བསྐལ་པ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་བར་དག་འདས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་པོ་གཞན་དག་ཏུ་མཚམས་མ་མཆིས་པའི་ལས་ཀྱིས་འཕེན་པར་འགྱུར་བའམ།
en: In the future, during the passing of as many great eons as there are particles in a buddha realm, there will be beings who will be born into the buddha realms in the ten directions, which are as numerous as the particles in a buddha realm, and they will be seized and hurled by that karma that has an immediate result at death.

source: ཀུན་ནས་སློང་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཀྱི་དོན་དུ་བདག་ལས་དེས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་མནར་མེད་པར་གནས་པ་ཉམས་སུ་མྱོང་བར་འགྱུར་ཞིང་བདག་གི་སེམས་ཅན་དག་ནི་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེ་བར་མ་གྱུར་ཅིག །
en: For the sake of all those beings, may I, as the result of their karma, reside in and experience the great Avīci hell, and through that may those beings never be reborn in hell.

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མཉེས་པར་འགྱུར་བ་དང་།
en: May all those beings please the bhagavat buddhas.

source: འཁོར་བ་ལས་རྒལ་བར་འགྱུར་བ་དང་།
en: May they transcend saṃsāra.

source: མྱ་ངན་ལས་འདས་པའི་གྲོང་ཁྱེར་དུ་འཇུག་པར་འགྱུར་བའི་ཡུན་རིང་པོ་དེ་སྲིད་ཀྱིས་བདག་སེམས་ཅན་དམྱལ་བ་ལས་ཡོངས་སུ་ཐར་བར་གྱུར་ཅིག །
en: May they enter the city of nirvāṇa. And then, after that long time has passed, may I be released from hell. “ ‘

source: སངས་རྒྱས་ཀྱི་ཞིང་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་བར་གཞན་དག་ན་སེམས་ཅན་རྣམས་ཀྱིས་དེ་ལྟ་བུའི་ལས་ཀུན་ནས་བསླང་བ་དང་། འཕངས་པ་དང་། མྱོང་བར་འགྱུར་བར་ངེས་པས་སེམས་ཅན་དམྱལ་བ་རབ་ཏུ་ཚ་བར་སྐྱེ་བར་འགྱུར་བ་དང་། དེ་བཞིན་དུ་ཚ་བ་དང་།
en: In the buddha realms in the ten directions, which are as numerous as the particles in a buddha realm, there are beings who are similarly seized and hurled by karma, are bound to that experience, and are going to be reborn in the Pratāpana hell, and so on, as previously described.

source: ངུ་འབོད་ཆེན་པོ་དང་། ངུ་འབོད་དང་། བསྡུས་གཞོམ་དང་། ཐིག་ནག་དང་། ཡང་སོས་ཀྱི་བར་དག་ལ་ཡང་ཇི་ལྟར་སྔར་སྨོས་པ་བཞིན་དུ་བརྗོད་པར་བགྱིའོ།
en: In the same way there are those who are going to be reborn in the Saṃtāpana, Mahāraurava, Saṃghāta, Kālasūtra, and Saṃjīvana hells.

source: །དེ་བཞིན་དུ་དུད་འགྲོ་སྣ་ཚོགས་དག་ལ་ཡང་བརྗོད་པར་བགྱིའོ། །དེ་བཞིན་དུ་གཤིན་རྗེའི་འཇིག་རྟེན་ལ་ཡང་བརྗོད་པར་བགྱིའོ། །དེ་བཞིན་དུ་གནོད་སྦྱིན་དབུལ་པོ་ལ་ཡང་བརྗོད་པར་བགྱིའོ། །དེ་བཞིན་དུ་གྲུལ་བུམ་དང་། ཤ་ཟ་དང་།
en: In the same way there are those who are going to be reborn as various animals, there are those who are going to be reborn in the world of Yama, there are those who are going to be reborn as poor yakṣas, and there are those who are going to be reborn as kumbhāṇḍas, piśācas, asuras, and garuḍas.

source: ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དག་ལ་ཡང་བརྗོད་པར་བགྱིའོ། །གང་གི་ཚེ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་པོ་གཞན་དག་ཏུ་སེམས་ཅན་རྣམས་སྔོན་གྱི་ལས་དེ་ལྟ་བུ་དག་གིས་འཕངས་པར་གྱུར་པ་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། གང་དག་མི་རྣམས་ཀྱི་ནང་དུ་འོན་པ་དང་།
en: There will be beings subject to karma in the same way in other worlds in the ten directions, which are as numerous as the particles in a buddha realm. “ ‘

source: ལོང་བ་དང་། ལྕེ་མ་མཆིས་པ་དང་། ལག་པ་མ་མཆིས་པ་དང་། རྐང་པ་མ་མཆིས་པ་དང་། དྲན་པ་རབ་ཏུ་ཉམས་པའི་སེམས་དང་ལྡན་པ་དག་ཏུ་སྐྱེ་བར་འགྱུར་བ་དང་།
en: In the same way, there will be those born as humans who will be either deaf or blind, without a tongue, without arms, without legs, or with no memory, or who will eat filth.

source: མི་གཙང་བ་ཟ་བ་རྣམས་ལ་ཡང་དེ་བཞིན་དུ་སྦྱར་ཏེ། ཇི་ལྟར་སྔར་སྨོས་པ་བཞིན་དུ་ཡང་བདག་སེམས་ཅན་དམྱལ་བ་མནར་མེད་པ་དག་ཏུ་སྐྱེ་བར་གྱུར་ཅིག །གལ་ཏེ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་རེ་བ་དེ་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་མི་འགྱུར་བལྟ་ན། འཁོར་བར་སེམས་ཅན་རྣམས་ཡུན་རིང་པོ་ཇི་སྲིད་དུ་ཁམས་དང་། སྐྱེ་མཆེད་དང་།
en: May I, as I have previously described, be reborn in the Avīci hell for the sake of all those beings. “ ‘

source: ཕུང་པོ་ཡོངས་སུ་འཛིན་པར་འགྱུར་བའི་ཡུན་རིང་པོ་དེ་སྲིད་དུ་བདག་ཇི་ལྟར་སྔར་སྨོས་པ་བཞིན་དུ་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོ་དང་། ཡི་དགས་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། སྲིན་པོ་རྣམས་སུ་མིའི་བར་གྱི་སྡུག་བསྔལ་སྐྱེ་བ་རྣམ་པ་སྣ་ཚོགས་དེ་ལྟ་བུ་དག་གིས་དེ་ལྟར་སྡུག་བསྔལ་ཉམས་སུ་མྱོང་བར་གྱུར་ཅིག །
en: If my aspiration for the highest, most complete enlightenment is not fulfilled, then may I suffer, as previously described, the various kinds of sufferings of hell beings, animals, pretas, yakṣas, asuras, rākṣasas, and so on, up to and including humans, for as long as beings in saṃsāra possess aggregates, sensory elements, and sensory bases. “ ‘

source: ཇི་སྟེ་བདག་གིས་སྔར་སྨོས་པའི་བར་གྱི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་རེ་བ་འདི་དག་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བདག་གི་དཔང་དུ་གྱུར་ཅིག །
en: If my previously described aspiration for the highest, most complete enlightenment is completely fulfilled, then may the bhagavat buddhas be my witnesses.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མ་མཆིས་གྲངས་མ་མཆིས་པ་གཞན་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་བཞུགས་ཏེ། འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་བདག་གི་དཔང་དུ་འགྱུར་ཞིང་ཡེ་ཤེས་སུ་འགྱུར་བར་གྱུར་ཅིག །
en: May the bhagavat buddhas who reside, live, and remain, teaching the Dharma in other countless, innumerable worlds in the ten directions, also be my witnesses, and have this knowledge of me. “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གིས་ཇི་ལྟར་དམ་བཅས་པ་དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་མཛད་པ་དག་སྒྲུབ་པར་རྔོ་ཐོགས་ཤིང་བདག་བསྐལ་པ་བཟང་པོ་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་བརྒྱ་ཉི་ཤུ་ཐུབ་པ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་འགྱུར་བ་ལྟ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་དུ་གསོལ།
en: Bhadanta Bhagavat, give me your prophecy of the highest, most complete enlightenment, that I may become, in the Bhadraka eon, at the time when beings live for 120 years, a tathāgata arhat samyaksam­buddha, endowed with wisdom and virtuous conduct, and so on, up to and including a buddha, and a bhagavat, so that I be able to accomplish such activity of a buddha as I have promised.’ “

source: དེ་ནས་དེའི་མོད་ལ་དེ་བཞིན་གཤེགས་པ་མ་གཏོགས་པར་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ས་དང་ནམ་མཁའི་ངོས་ལ་གནས་པ་དེ་དག་ཐམས་ཅད་མཆི་མ་རབ་ཏུ་འཛག་བཞིན་དུ་ཡན་ལག་ལྔས་རྐང་པ་ལ་ཕྱག་བྱས་ཏེ་སྨྲས་པ།
en: At that time, the entire assembly—apart from the Tathāgata—and the world with its devas, humans, and asuras, on the ground or in the sky, shed tears and bowed down the five points of their bodies to Samudrareṇu’s feet and said, ‘Excellent, excellent, you who have great compassion!

source: སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཁྱོད་ཀྱིས་དྲན་པ་ཟབ་མོ་ཐོབ་པ་དང་། སེམས་ཅན་ཟབ་མོ་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོ་བསྐྱེད་པ་དང་། སྨོན་ལམ་ཆེན་པོ་ཟབ་མོ་བཏབ་པ་ནི་ལེགས་སོ་ལེགས་སོ།
en: Your mindfulness is profound, your great compassion for beings is profound, and the great prayer you have made is profound.

source: །ལྷག་པའི་བསམ་པ་དེས་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཆེན་པོས་ཡང་དག་པར་བཀབ་ཅིང་མཚམས་མེད་པ་བྱེད་པ་དང་། མི་དགེ་བའི་རྩ་བའི་བར་དང་འགྲོགས་པའི་འདུལ་བ་རྣམས་ཀྱང་ཕལ་ཆེར་ཡོངས་སུ་བཟུང་བ་ཡིན་ནོ།
en: With your exceptional motivation, with great compassion for all beings, you have taken as your disciples those who were hidden from view, those who have committed many actions that have immediate results at death, and so on, up to and including those who have engaged in bad roots.

source: །ཇི་ལྟར་ཁྱོད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པའི་སྨོན་ལམ་དེས་ན་སེམས་ཅན་རྣམས་ཀྱི་སྨན་དང་། སྐྱབས་དང་། དཔུང་གཉེན་དུ་གྱུར་པར་ཤེས་སོ།
en: We know through the prayer that you made when you first developed the aspiration to attain the complete enlightenment of perfect buddhahood that you will become a medicine, a refuge, and a protector for beings.

source: །སེམས་ཅན་རྣམས་སྡུག་བསྔལ་ལས་རབ་ཏུ་ཐར་བར་བྱ་བའི་སྨོན་ལམ་བཏབ་པ་དེ་བཞིན་དུ་ཁྱོད་ཀྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག །
en: You have prayed to free beings from suffering—may your wishes be completely fulfilled!

source: བཅོམ་ལྡན་འདས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་ཡང་གྱུར་ཅིག །
en: And may the Bhagavat give you the prophecy of your highest, complete enlightenment!’ “

source: རྒྱལ་པོ་བདུད་རྩི་དག་པ་ཉིད་ཀྱང་ངུ་ཞིང་བྲམ་ཟེའི་རྐང་པ་ལ་ཡན་ལག་ལྔས་ཕྱག་བྱས་ཏེ་སྨྲས་པ།
en: King Amṛtaśuddha also wept and bowed down the five points of his body to the brahmin’s feet and said: “ ‘Aho!

source: ཨེ་མའོ་མཆོག་ཏུ་ཟབ་པ་པོ། །ཁྱོད་ནི་བདེ་ལ་མི་གནས་ཏེ།
en: Most profound one, You do not remain in bliss.

source: །ཁྱོད་ནི་སེམས་ཅན་སྙིང་རྗེ་ལྡན།
en: You have sympathy for beings.

source: །ཁྱོད་ནི་བདག་གི་མཚོན་མ་ཡིན།
en: You are the one who shows us the way.’ “

source: །དེ་བཞིན་དུ་སྦྱར་ཏེ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་སྨྲས་པ། སེམས་ཅན་ཆགས་པ་དག་ལ་ཁྱོད་མ་ཆགས། །དབང་པོ་རྟ་ཐུལ་རྣམས་ལས་དབང་རྟ་ཐུལ།
en: In the same way, Avalokiteśvara said: “ ‘You are unattached among beings who are attached; You have transcended the senses among those very much intent on the senses.

source: །དབང་པོ་འདི་རྣམས་ལ་ནི་དབང་མཛད་དེ།
en: You maintain lordship over the senses here.

source: །གཟུངས་དང་ཡེ་ཤེས་ཀྱི་ནི་མཛོད་དུ་འགྱུར།
en: You will become a treasure of dhāraṇī and wisdom.’ “

source: །དེ་བཞིན་དུ་སྦྱར་ཏེ་མཐུ་ཆེན་ཐོབ་ཀྱིས་སྨྲས་པ། སེམས་ཅན་བྱེ་བ་སྟོང་ཕྲག་མང་པོ་རྣམས། །དགེ་བའི་དོན་དུ་ཀུན་ནས་འདུས་པ་དག །
en: In the same way, Mahāsthāmaprāpta said: “ ‘You have gathered many thousands of ten millions Of beings for the sake of good actions.

source: མཆོག་ཏུ་དཀའ་བའི་སྡུག་བསྔལ་ཆེན་པོ་ཡི། །ཁྱོད་ནི་སྙིང་རྗེ་ལ་ནི་ངུ་བར་བྱེད།
en: You weep with compassion, You who undergo the greatest hardships.’ “

source: །བྱང་ཆུབ་སེམས་དཔའ་འཇམ་དཔལ་གྱིས་སྨྲས་པ། བརྩོན་འགྲུས་ཏིང་འཛིན་བརྟན་པ་དང་། །མཁས་པ་དང་ནི་ཤེས་རབ་མཆོག །ཕྲེང་བ་དྲི་དང་བྱུག་པ་ཡིས། །དེ་ཕྱིར་ཁྱོད་ལ་མཆོད་པར་འོས།
en: In the same way, the bodhisattva Mañjuśrī said: “ ‘You who have unwavering diligence and samādhi, You who have supreme wisdom and sagacity, You are worthy of our offerings Of garlands, incense, and perfumes.’ “

source: །བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་ཕྱག་རྒྱས་སྨྲས་པ། སྙིང་རྗེ་ཆེན་པོས་སེམས་ཅན་ལ། །དེ་ལྟར་ཁྱོད་ཀྱིས་སྦྱིན་པ་བྱིན།
en: In the same way, the bodhisattva Gaganamudra said: “ ‘In this way you have made a gift To beings, you who have great compassion.

source: །ཁྱོད་ནི་དུས་འདི་ཟད་ནས་ཀྱང་། །མགོན་པོ་མཚན་གྱི་མཆོག་ཏུ་འགྱུར།
en: When this time has perished, you will become A protector who has the supreme signs.’ “

source: །བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེས་གཅོད་པ་ཤེས་རབ་སྣང་བའི་དཔལ་གྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཇི་ལྟར་ནམ་མཁའ་རྒྱ་ཆེ་བ། །དེ་ལྟར་ཁྱོད་ཀྱི་སྙིང་རྗེའི་གནས།
en: Also, the bodhisattva Vajraccheda­prajñā­vabhāsaśrī said: “ ‘Just as space is immensely vast, So is your compassionate motivation.

source: །ཁྱོད་ཀྱིས་སེམས་ཅན་འཇིགས་མེད་ལ། །བྱང་ཆུབ་སྤྱོད་པ་དག་ཀྱང་བསྟན།
en: For the sake of beings you have taught The types of enlightened conduct.’ “

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་སྣང་བྱེད་ཤུགས་ཀྱིས་སྨྲས་པ། དེ་བཞིན་གཤེགས་པ་མ་གཏོགས་པར། །སེམས་ཅན་ལ་བརྩེ་གཞན་མེད་དེ།
en: The bodhisattva Vegavairocana said: “ ‘No one else has such compassion for beings, Other than the Tathāgata.

source: །གང་ཕྱིར་ཤེས་རབ་མཁས་པའི་མཆོག །ཁྱོད་ནི་ཡོན་ཏན་ཀུན་དང་ལྡན། །སྤོས་ཀྱི་སེང་གེས་སྨྲས་པ།
en: You are endowed with all good qualities. You have supreme wisdom and sagacity.’ “

source: ཁྱོད་ནི་མ་འོངས་དུས་ན་ནི། །བཟང་ལ་ཉོན་མོངས་བདུད་ཀྱི་ཚེ། །སེམས་ཅན་སྡུག་བསྔལ་སྒྲོལ་བྱེད་ཅིང་། །ཁྱོད་ཀྱི་གྲགས་དང་སྙན་པ་འཐོབ།
en: Siṃhagandha said: “ ‘In the future, when there comes The Bhadraka eon with its māra of kleśas, You will gain fame and renown For freeing beings from suffering.’ “

source: །བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོས་སྨྲས་པ། སྐྱེ་བའི་དགོན་པར་བརྩོན་གྱུར་ཅིང་། །ལོག་སྒྱུས་ཤིན་ཏུ་ཉམ་ང་བ། །ཤ་ཟ་བ་དང་ཁྲག་འཐུང་བའི། །སེམས་རྒྱུད་ཚིག་རྣམས་བཟུང་བར་གྱུར།
en: The bodhisattva Samantabhadra said: “ ‘Those who are struggling in the wilderness of rebirth, Who rely on what is false, who are in despair, Whose minds are burning, and who feed on flesh and blood, You have taken them into your care.’ “

source: །མི་འཁྲུགས་པས་སྨྲས་པ། མ་རིག་སྒོ་ངའི་སྦུབས་ཆུད་ཅིང་། །ཉོན་མོངས་འདམ་དུ་བྱིང་གྱུར་ལ། །མཚམས་མེད་པ་དག་བྱེད་པ་པོ། །སེམས་རྒྱུད་ཚིག་རྣམས་བཟུང་བར་གྱུར།
en: Akṣobhya said: “ ‘Stuck inside the egg of ignorance, Sunk in the swamp of the kleśas, Their minds are burning, but you take them into your care, These beings who commit bad actions with immediate results at death.’ “

source: །སྤོས་ཀྱི་གླང་པོས་སྨྲས་པ། ཁྱོད་ཀྱིས་མ་འོངས་འཇིགས་མཐོང་བ། །ཇི་ལྟར་མེ་ལོང་དཀྱིལ་འཁོར་བཞིན།
en: Gandhahasti said: “ ‘You have seen the fears of the future, Just like looking into a mirror.

source: །དམ་པའི་ཆོས་ནི་སྤོང་བྱེད་པའི། །སེམས་རྒྱུད་ཚིག་རྣམས་བཟུང་བར་གྱུར།
en: You have taken into your care those with burning minds, Those who have rejected the good Dharma.’ “

source: །རིན་པོ་ཆེ་ཏོག་གིས་སྨྲས་པ། ཡེ་ཤེས་ཚུལ་ཁྲིམས་ཏིང་འཛིན་དང་། །སྙིང་རྗེའི་རྒྱན་གྱིས་བརྒྱན་པ་པོ། །འཕགས་ལ་སྐུར་པ་འདེབས་བྱེད་པ། །སེམས་རྒྱུད་ཚིག་རྣམས་བཟུང་བར་གྱུར།
en: Ratnaketu said: “ ‘You have wisdom, correct conduct, and samādhi; You are adorned by sympathy and compassion.

source: །འཇིགས་དང་གདུང་བྲལ་གྱིས་སྨྲས་པ།
en: You have taken into your care those with burning minds, Those who malign the noble ones.’ “

source: །ཁྱོད་ཀྱིས་ངན་སོང་གསུམ་ལམ་དུ། །སེམས་ཅན་སྡུག་བསྔལ་རྣམས་མཐོང་བ། །ཆང་པ་སྟོང་འདྲར་གནས་གྱུར་པ།
en: Vigatabhayasaṃtāpa said: “ ‘You have seen the suffering of beings Who travel the path of the three lower existences.

source: །སེམས་རྒྱུད་ཚིག་རྣམས་བཟུང་བར་གྱུར།
en: You have taken into your care those with burning minds, Those who rely on others with empty, closed hands.’ “

source: །ལག་ན་ཨུད་པ་ལས་སྨྲས་པ། ཁྱོད་ཀྱི་སྙིང་རྗེ་ཡེ་ཤེས་དང་། །བརྩོན་འགྲུས་ཀྱིས་ནི་འཁོར་བ་བཅོམ།
en: Utpalahasta said: “ ‘With compassion, wisdom, and diligence You have defeated the host.

source: །སྐྱེ་དང་འཆི་བས་གཟིར་གྱུར་པ། །སེམས་རྒྱུད་ཚིག་རྣམས་བཟུང་བར་གྱུར།
en: You have taken into your care those with burning minds, Those who are oppressed by birth and death.’ “

source: །ཡེ་ཤེས་གྲགས་པས་སྨྲས་པ། ནད་མང་དག་གིས་ཉེན་པ་དང་། །ཉོན་མོངས་རླུང་གིས་དེད་པ་དག །ཡེ་ཤེས་ཆུ་ཡིས་ཞི་བྱས་ཏེ། །བདུད་ཀྱི་སྡེ་རྣམས་རབ་ཏུ་བཅོམ།
en: Jñānakīrti said: “ ‘Those who are afflicted by many illnesses, Those who are impelled by the wind of the kleśas, You bring them peace with the water of wisdom, And you thoroughly defeat Māra’s army.’ “

source: །གཟུངས་ཀྱི་ཕྱག་རྒྱས་ཀྱང་སྨྲས་པ། །ཇི་ལྟར་ཁྱོད་ནི་ཉི་མ་བཞིན། །ཉོན་མོངས་དྲ་བ་རབ་བཅོམ་སྟེ། །ཉོན་མོངས་ཟད་ཅིང་རྣམ་ཐར་པའི། །བརྩོན་འགྲུས་བརྟན་པ་ངེད་ལ་མེད།
en: Dharaṇīmudra said: “ ‘We do not have unwavering diligence In ending and liberating from the kleśas, Like you, O hero, who are like the sun.

source: །ཨུད་པ་ལ་ཟླ་བས་ཀྱང་སྨྲས་པ།
en: You destroy the net of the kleśas.’ “

source: ཇི་ལྟར་ཡོན་ཏན་སྙིང་རྗེའི་གནས། །བརྩོན་འགྲུས་བརྟན་པ་ཡང་དག་མོས།
en: Utpalacandra said: “ ‘You have the determination of unwavering diligence Like one whose foundation is virtue and compassion.

source: །སྲིད་པའི་འཆིང་བས་རབ་བསྡམས་པ། །ཁམས་གསུམ་པོ་དག་གྲོལ་བར་བྱེད།
en: You liberate the three worlds, Which are bound by the bonds of existence.’ “

source: །དྲི་མེད་དབང་པོས་སྨྲས་པ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་གྱི། །སྙིང་རྗེ་ཆེན་པོ་དག་བསྟན་པ།
en: Vimalendra said: “ ‘You have taught the great compassion Of the bodhisattvas’ field of activity.

source: །སྙིང་རྗེའི་རྒྱུ་ལས་བྱུང་བ་པོ། །ཁྱོད་ལ་བདག་ཅག་ཕྱག་འཚལ་ལོ།
en: We pay homage to you, Who appeared because of compassion.’ “

source: །སྟོབས་ཆེན་ཤུགས་འཆང་གིས་ཀྱང་སྨྲས་པ། ཉོན་མོངས་ལྡན་པའི་རྩོད་དུས་ཚེ། །བྱང་ཆུབ་གང་དག་ཁྱོད་ལ་རྟེན། །ཁྱོད་ཀྱིས་ཉོན་མོངས་རྩད་ནས་བཅད། །སྨོན་ལམ་བརྟན་པ་འགྲུབ་པར་འགྱུར།
en: Mahābalavegadhārin said: “ ‘In the kaliyuga time of kleśas, You have depended upon enlightenment, You have cut through the kleśas at their roots, And your resolute prayer is accomplished.’ “

source: །སྐར་མ་སྐྱོང་གིས་ཀྱང་སྨྲས་པ། ཡེ་ཤེས་མཛོད་དང་མཚུངས་འདྲ་བ།
en: Jyotipāla said: “ ‘You are like a treasure of wisdom.

source: །དྲི་མེད་སྨོན་ལམ་བཏབ་པ་ཡིས།
en: You have made a stainless prayer.

source: །བྱང་ཆུབ་སྤྱོད་ཕྱིར་སེམས་ཅན་གྱི།
en: You carry out the conduct of enlightenment.

source: །སྨན་དང་རྟེན་དུ་ཁྱོད་འགྱུར་རོ།
en: You become medicine for beings to depend upon.’ “

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྟོབས་ཡང་དག་པར་སྟོན་པ་ངུ་ཞིང་བྲམ་ཟེའི་རྐང་པ་ལ་ཡན་ལག་ལྔས་ཕྱག་བྱས་ཏེ་ཐལ་མོ་སྦྱར་ནས་སྨྲས་པ།
en: The bodhisattva mahāsattva Balasandarśana, weeping, bowed down the five points of his body to the feet of the brahmin, and with his palms placed together he said: “ ‘Aho!

source: ཀྱེ་མ་ཤེས་སྒྲོན་སེམས་ཅན་རྣམས།
en: You are a lamp of wisdom for beings.

source: །ཉོན་མོངས་ནད་རྣམས་རྣམ་པར་བཅོམ།
en: You destroy the illness of the kleśas.

source: །ཁྱོད་ནི་རབ་འབར་སྙིང་རྗེ་ཅན།
en: Compassionate one, you shine brightly.

source: །སེམས་ཅན་སྡུག་བསྔལ་གྲོལ་བར་མཛད།
en: You liberate beings from suffering.’ “

source: །རིགས་ཀྱི་བུ་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། ལྷ་དང་། དྲི་ཟ་དང་། མི་དང་བཅས་པ་དག་གིས་ཀྱང་བྲམ་ཟེའི་རྐང་པ་ལ་ཡན་ལག་ལྔས་ཕྱག་བྱས་ནས་ཐལ་མོ་སྦྱར་ཏེ་དོན་དང་། ཚིག་སྣ་ཚོགས་དང་ལྡན་པའི་ཚིགས་སུ་བཅད་པ་དག་གིས་མངོན་པར་བསྟོད་ནས་འཁོད་དོ།
en: Noble son, the entire assembly with its devas, gandharvas, and humans bowed down the five points of their bodies to the feet of the brahmin, and with palms placed together they stood and praised him with verses that contained various words and meanings. “

source: །རིགས་ཀྱི་བུ་གང་གི་ཚེ་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་སྤྱན་སྔར་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་པ་དང་། དེ་ནས་དེའི་མོད་ལ་ས་ཆེར་གཡོས་པར་གྱུར་ཅིང་ཕྱོགས་བཅུ་ཀུན་གྱི་སངས་རྒྱས་ཀྱི་ཞིང་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་གིས་ཡང་གཡོས། རབ་ཏུ་གཡོས། ཀུན་ཏུ་རབ་ཏུ་གཡོས། འཁྲུགས།
en: Noble son, when the brahmin Samudrareṇu knelt on his right knee before the Tathāgata Ratnagarbha, at that moment the earth shook strongly, and in the buddha realms in the ten directions, as numerous as the particles in a buddha realm, the ground shook, shook strongly, shook intensely; shuddered, shuddered strongly, shuddered intensely; quaked, quaked strongly, quaked intensely; and rumbled, rumbled strongly, and rumbled intensely.

source: རབ་ཏུ་འཁྲུགས།
en: There also shone a great light, and there fell a rain of various flowers—coral tree flowers, great coral tree flowers, and so on, up to and including flowers with infinite radiance. “

source: ཀུན་ཏུ་རབ་ཏུ་འཁྲུགས། ལྡེག །རབ་ཏུ་ལྡེག །ཀུན་ཏུ་རབ་ཏུ་ལྡེག་ཅིང་། ཀུན་ཏུ་རབ་ཏུ་འུར་འུར་གྱི་བར་དུ་གྱུར་ནས་ཡང་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དང་།
en: In the ten directions, in world realms as numerous as the particles in a buddha realm, there were bhagavat buddhas, who resided, lived, and remained, teaching the Dharma to beings in pure buddha realms and in impure buddha realms.

source: ཡོངས་སུ་མ་དག་པ་གང་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱང་སྟོན་པ་དག་ཏུ་ཡང་སྣང་བ་ཆེན་པོ་བྱུང་བར་གྱུར་ཅིང་མེ་ཏོག་སྣ་ཚོགས་ཀྱི་ཆར་དག་ཀྱང་རབ་ཏུ་བབ་པར་གྱུར་ཏེ། འདི་ལྟ་སྟེ།
en: There were also bodhisattva mahāsattvas who were sitting in the presence of those bhagavat buddhas in order to listen to the Dharma.

source: མེ་ཏོག་མན་དཱ་ར་བ་དང་། མན་དཱ་ར་བ་ཆེན་པོ་དང་། འོད་མཐའ་ཡས་ཀྱི་བར་གྱི་མེ་ཏོག་གི་ཆར་དེ་ལྟ་བུ་དག་ཀྱང་རབ་ཏུ་བབ་པར་གྱུར་ཏོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་ཆོས་ཉན་པའི་ཕྱིར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་སྤྱན་སྔ་ན་འདུག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས་ས་གཡོས་པ་དེ་མཐོང་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་འདི་སྐད་ཅེས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་ས་ཆེར་གཡོས་ཤིང་། མེ་ཏོག་གི་ཆར་ཆེན་པོ་ཡང་མངོན་པར་རབ་ཏུ་བབ་པར་གྱུར་པའི་རྒྱུ་ནི་གང་ལགས།
en: Those bodhisattva mahāsattvas saw the ground shake, and they asked the bhagavat buddhas, ‘Bhagavat, for what reason did the great earth shake, a light shine, and a great rain of flowers fall?’ “

source: རྐྱེན་ནི་གང་ལགས་ཞེས་ཡོངས་སུ་ཞུས་སོ། །ཡང་དེའི་ཚེ་ན་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་བསྩགས་པ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: At that time, in the eastern direction from this buddha realm, beyond as many buddha realms as there are grains of sand in the Ganges River, there was a world realm called Ratnavicayā.

source: སངས་རྒྱས་ཀྱི་ཞིང་རིན་པོ་ཆེ་བསྩགས་པ་དེ་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་ཟླ་བ་ཞེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་གིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་ཏེ་ཐེག་པ་ཆེན་པོའི་གཏམ་འབའ་ཞིག་གིས་ཆོས་སྟོན་ཏོ།
en: In the Ratnavicayā buddha realm there resided, lived, and remained a tathāgata arhat samyaksam­buddha named Ratnacandra, and, surrounded and attended by countless, innumerable bodhisattvas, he taught the Dharma with a talk on the Mahāyāna. “

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རིན་པོ་ཆེའི་ཏོག་དང་།
en: In that buddha realm there were the bodhisattva mahāsattvas Ratnaketu and Candraketu.
